src/test/java/soapService/Soaprequestspayload.java

package soapService;

public class Soaprequestspayload {

  /*  String url = "https://www.dataaccess.com/webservicesserver/NumberConversion.wso";
    String payload = "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n"
            + "<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n"
            + "  <soap:Body>\r\n"
            + "    <NumberToWords xmlns=\"http://www.dataaccess.com/webservicesserver/\">\r\n"
            + "      <ubiNum>500</ubiNum>\r\n"
            + "    </NumberToWords>\r\n"
            + "  </soap:Body>\r\n"
            + "</soap:Envelope>";


    String url = "http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso";
    String payload = "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n"
            + "<soap12:Envelope xmlns:soap12=\"http://www.w3.org/2003/05/soap-envelope\">\r\n"
            + "  <soap12:Body>\r\n"
            + "    <ListOfContinentsByName xmlns=\"http://www.oorsprong.org/websamples.countryinfo\">\r\n"
            + "    </ListOfContinentsByName>\r\n"
            + "  </soap12:Body>\r\n"
            + "</soap12:Envelope>";
            
            */



}
